(env) secorec@boso:~/computer_vision$ python gender.py 
Using TensorFlow backend.
(10586, 100, 100, 3)
(10586,)
2382
8204
0.2250
(2647, 100, 100, 3)
(2647,)
595
2052
0.2248
(10586, 100, 100, 3)
(2647, 100, 100, 3)
2018-02-23 17:02:18.388633: I tensorflow/core/platform/cpu_feature_guard.cc:137] Your CPU supports instructions that this TensorFlow binary was not compiled to use: SSE4.1 SSE4.2 AVX
2018-02-23 17:02:18.950993: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1105] Found device 0 with properties: 
name: GeForce GTX TITAN X major: 5 minor: 2 memoryClockRate(GHz): 1.076
pciBusID: 0000:05:00.0
totalMemory: 11.92GiB freeMemory: 11.80GiB
2018-02-23 17:02:18.951030: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1195] Creating TensorFlow device (/device:GPU:0) -> (device: 0, name: GeForce GTX TITAN X, pci bus id: 0000:05:00.0, compute capability: 5.2)
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 100, 100, 32)      896       
_________________________________________________________________
batch_normalization_1 (Batch (None, 100, 100, 32)      128       
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 100, 100, 32)      0         
_________________________________________________________________
activation_1 (Activation)    (None, 100, 100, 32)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 50, 50, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 50, 50, 32)        9248      
_________________________________________________________________
batch_normalization_2 (Batch (None, 50, 50, 32)        128       
_________________________________________________________________
gaussian_noise_2 (GaussianNo (None, 50, 50, 32)        0         
_________________________________________________________________
activation_2 (Activation)    (None, 50, 50, 32)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 25, 25, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 25, 25, 64)        18496     
_________________________________________________________________
batch_normalization_3 (Batch (None, 25, 25, 64)        256       
_________________________________________________________________
gaussian_noise_3 (GaussianNo (None, 25, 25, 64)        0         
_________________________________________________________________
activation_3 (Activation)    (None, 25, 25, 64)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 12, 12, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 12, 12, 64)        36928     
_________________________________________________________________
batch_normalization_4 (Batch (None, 12, 12, 64)        256       
_________________________________________________________________
gaussian_noise_4 (GaussianNo (None, 12, 12, 64)        0         
_________________________________________________________________
activation_4 (Activation)    (None, 12, 12, 64)        0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 6, 6, 64)          0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 6, 6, 128)         73856     
_________________________________________________________________
batch_normalization_5 (Batch (None, 6, 6, 128)         512       
_________________________________________________________________
gaussian_noise_5 (GaussianNo (None, 6, 6, 128)         0         
_________________________________________________________________
activation_5 (Activation)    (None, 6, 6, 128)         0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 3, 3, 128)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 3, 3, 128)         147584    
_________________________________________________________________
batch_normalization_6 (Batch (None, 3, 3, 128)         512       
_________________________________________________________________
gaussian_noise_6 (GaussianNo (None, 3, 3, 128)         0         
_________________________________________________________________
activation_6 (Activation)    (None, 3, 3, 128)         0         
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 1, 1, 128)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               66048     
_________________________________________________________________
activation_7 (Activation)    (None, 512)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 1026      
_________________________________________________________________
activation_8 (Activation)    (None, 2)                 0         
=================================================================
Total params: 355,874
Trainable params: 354,978
Non-trainable params: 896
_________________________________________________________________
Epoch 1/150
53/52 [==============================] - 24s 450ms/step - loss: 0.6247 - acc: 0.7675 - val_loss: 0.4471 - val_acc: 0.8213
Epoch 2/150
53/52 [==============================] - 23s 433ms/step - loss: 0.4119 - acc: 0.7991 - val_loss: 0.3655 - val_acc: 0.8213
Epoch 3/150
53/52 [==============================] - 23s 436ms/step - loss: 0.3783 - acc: 0.8223 - val_loss: 0.4502 - val_acc: 0.7405
Epoch 4/150
53/52 [==============================] - 23s 438ms/step - loss: 0.3641 - acc: 0.8277 - val_loss: 0.3607 - val_acc: 0.8300
Epoch 5/150
53/52 [==============================] - 23s 438ms/step - loss: 0.3448 - acc: 0.8414 - val_loss: 0.4038 - val_acc: 0.7937
Epoch 6/150
53/52 [==============================] - 23s 436ms/step - loss: 0.3378 - acc: 0.8468 - val_loss: 0.3879 - val_acc: 0.8036
Epoch 7/150
53/52 [==============================] - 23s 436ms/step - loss: 0.3291 - acc: 0.8496 - val_loss: 0.3105 - val_acc: 0.8606
Epoch 8/150
53/52 [==============================] - 23s 437ms/step - loss: 0.3205 - acc: 0.8548 - val_loss: 0.3233 - val_acc: 0.8693
Epoch 9/150
53/52 [==============================] - 23s 436ms/step - loss: 0.3118 - acc: 0.8587 - val_loss: 0.3493 - val_acc: 0.8564
Epoch 10/150
53/52 [==============================] - 23s 439ms/step - loss: 0.3039 - acc: 0.8629 - val_loss: 0.3002 - val_acc: 0.8750
Epoch 11/150
53/52 [==============================] - 23s 434ms/step - loss: 0.2997 - acc: 0.8660 - val_loss: 0.4685 - val_acc: 0.7726
Epoch 12/150
53/52 [==============================] - 23s 436ms/step - loss: 0.2897 - acc: 0.8700 - val_loss: 0.4618 - val_acc: 0.8258
Epoch 13/150
53/52 [==============================] - 23s 434ms/step - loss: 0.2810 - acc: 0.8797 - val_loss: 0.2964 - val_acc: 0.8685
Epoch 14/150
53/52 [==============================] - 23s 435ms/step - loss: 0.2698 - acc: 0.8830 - val_loss: 0.2751 - val_acc: 0.8765
Epoch 15/150
53/52 [==============================] - 23s 437ms/step - loss: 0.2687 - acc: 0.8836 - val_loss: 0.6491 - val_acc: 0.7934
Epoch 16/150
53/52 [==============================] - 23s 436ms/step - loss: 0.2590 - acc: 0.8896 - val_loss: 0.4086 - val_acc: 0.8368
Epoch 17/150
53/52 [==============================] - 23s 435ms/step - loss: 0.2494 - acc: 0.8929 - val_loss: 0.6788 - val_acc: 0.7990
Epoch 18/150
53/52 [==============================] - 23s 433ms/step - loss: 0.2423 - acc: 0.8972 - val_loss: 0.2102 - val_acc: 0.9097
Epoch 19/150
53/52 [==============================] - 23s 439ms/step - loss: 0.2346 - acc: 0.9051 - val_loss: 0.2939 - val_acc: 0.8719
Epoch 20/150
53/52 [==============================] - 23s 436ms/step - loss: 0.2215 - acc: 0.9067 - val_loss: 0.4130 - val_acc: 0.8432
Epoch 21/150
53/52 [==============================] - 23s 438ms/step - loss: 0.2080 - acc: 0.9118 - val_loss: 0.5432 - val_acc: 0.8338
Epoch 22/150
53/52 [==============================] - 23s 437ms/step - loss: 0.2050 - acc: 0.9155 - val_loss: 0.3917 - val_acc: 0.8500
Epoch 23/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1940 - acc: 0.9186 - val_loss: 0.2409 - val_acc: 0.9014
Epoch 24/150
53/52 [==============================] - 23s 439ms/step - loss: 0.1879 - acc: 0.9220 - val_loss: 0.2061 - val_acc: 0.9210
Epoch 25/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1790 - acc: 0.9288 - val_loss: 0.2095 - val_acc: 0.9184
Epoch 26/150
53/52 [==============================] - 23s 440ms/step - loss: 0.1757 - acc: 0.9268 - val_loss: 0.6783 - val_acc: 0.7594
Epoch 27/150
53/52 [==============================] - 23s 433ms/step - loss: 0.1687 - acc: 0.9323 - val_loss: 0.3015 - val_acc: 0.8931
Epoch 28/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1674 - acc: 0.9335 - val_loss: 0.2752 - val_acc: 0.8927
Epoch 29/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1642 - acc: 0.9326 - val_loss: 0.3072 - val_acc: 0.8969
Epoch 30/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1599 - acc: 0.9324 - val_loss: 0.1564 - val_acc: 0.9411
Epoch 31/150
53/52 [==============================] - 24s 444ms/step - loss: 0.1447 - acc: 0.9419 - val_loss: 0.1447 - val_acc: 0.9437
Epoch 32/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1363 - acc: 0.9471 - val_loss: 0.1448 - val_acc: 0.9433
Epoch 33/150
53/52 [==============================] - 23s 433ms/step - loss: 0.1357 - acc: 0.9466 - val_loss: 0.1462 - val_acc: 0.9445
Epoch 34/150
53/52 [==============================] - 23s 442ms/step - loss: 0.1342 - acc: 0.9492 - val_loss: 0.1527 - val_acc: 0.9414
Epoch 35/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1328 - acc: 0.9488 - val_loss: 0.1435 - val_acc: 0.9441
Epoch 36/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1357 - acc: 0.9458 - val_loss: 0.1455 - val_acc: 0.9467
Epoch 37/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1349 - acc: 0.9447 - val_loss: 0.1499 - val_acc: 0.9437
Epoch 38/150
53/52 [==============================] - 23s 439ms/step - loss: 0.1355 - acc: 0.9445 - val_loss: 0.1424 - val_acc: 0.9471
Epoch 39/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1296 - acc: 0.9502 - val_loss: 0.2026 - val_acc: 0.9297
Epoch 40/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1303 - acc: 0.9457 - val_loss: 0.1383 - val_acc: 0.9498
Epoch 41/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1290 - acc: 0.9475 - val_loss: 0.1477 - val_acc: 0.9441
Epoch 42/150
53/52 [==============================] - 23s 439ms/step - loss: 0.1335 - acc: 0.9489 - val_loss: 0.1431 - val_acc: 0.9471
Epoch 43/150
53/52 [==============================] - 23s 442ms/step - loss: 0.1338 - acc: 0.9477 - val_loss: 0.1572 - val_acc: 0.9437
Epoch 44/150
53/52 [==============================] - 23s 438ms/step - loss: 0.1301 - acc: 0.9487 - val_loss: 0.1405 - val_acc: 0.9486
Epoch 45/150
53/52 [==============================] - 23s 434ms/step - loss: 0.1286 - acc: 0.9480 - val_loss: 0.1524 - val_acc: 0.9441
Epoch 46/150
53/52 [==============================] - 23s 434ms/step - loss: 0.1235 - acc: 0.9512 - val_loss: 0.1443 - val_acc: 0.9456
Epoch 47/150
53/52 [==============================] - 23s 440ms/step - loss: 0.1257 - acc: 0.9516 - val_loss: 0.1685 - val_acc: 0.9399
Epoch 48/150
53/52 [==============================] - 23s 440ms/step - loss: 0.1251 - acc: 0.9502 - val_loss: 0.1358 - val_acc: 0.9505
Epoch 49/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1297 - acc: 0.9489 - val_loss: 0.1359 - val_acc: 0.9509
Epoch 50/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1268 - acc: 0.9501 - val_loss: 0.1362 - val_acc: 0.9513
Epoch 51/150
53/52 [==============================] - 23s 434ms/step - loss: 0.1254 - acc: 0.9503 - val_loss: 0.1479 - val_acc: 0.9418
Epoch 52/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1287 - acc: 0.9501 - val_loss: 0.1439 - val_acc: 0.9479
Epoch 53/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1208 - acc: 0.9547 - val_loss: 0.1771 - val_acc: 0.9384
Epoch 54/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1281 - acc: 0.9486 - val_loss: 0.1347 - val_acc: 0.9516
Epoch 55/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1251 - acc: 0.9489 - val_loss: 0.1590 - val_acc: 0.9430
Epoch 56/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1247 - acc: 0.9523 - val_loss: 0.1554 - val_acc: 0.9448
Epoch 57/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1245 - acc: 0.9500 - val_loss: 0.1389 - val_acc: 0.9482
Epoch 58/150
53/52 [==============================] - 24s 446ms/step - loss: 0.1242 - acc: 0.9510 - val_loss: 0.1529 - val_acc: 0.9467
Epoch 59/150
53/52 [==============================] - 23s 439ms/step - loss: 0.1205 - acc: 0.9518 - val_loss: 0.1338 - val_acc: 0.9505
Epoch 60/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1200 - acc: 0.9544 - val_loss: 0.1408 - val_acc: 0.9532
Epoch 61/150
53/52 [==============================] - 23s 443ms/step - loss: 0.1213 - acc: 0.9513 - val_loss: 0.1474 - val_acc: 0.9482
Epoch 62/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1206 - acc: 0.9526 - val_loss: 0.1390 - val_acc: 0.9494
Epoch 63/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1160 - acc: 0.9554 - val_loss: 0.1360 - val_acc: 0.9524
Epoch 64/150
53/52 [==============================] - 23s 441ms/step - loss: 0.1181 - acc: 0.9529 - val_loss: 0.1722 - val_acc: 0.9411
Epoch 65/150
53/52 [==============================] - 23s 440ms/step - loss: 0.1212 - acc: 0.9527 - val_loss: 0.1451 - val_acc: 0.9528
Epoch 66/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1154 - acc: 0.9559 - val_loss: 0.1364 - val_acc: 0.9528
Epoch 67/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1178 - acc: 0.9546 - val_loss: 0.1484 - val_acc: 0.9509
Epoch 68/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1194 - acc: 0.9519 - val_loss: 0.1392 - val_acc: 0.9494
Epoch 69/150
53/52 [==============================] - 23s 438ms/step - loss: 0.1209 - acc: 0.9531 - val_loss: 0.1393 - val_acc: 0.9505
Epoch 70/150
53/52 [==============================] - 23s 438ms/step - loss: 0.1206 - acc: 0.9517 - val_loss: 0.1428 - val_acc: 0.9543
Epoch 71/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1212 - acc: 0.9521 - val_loss: 0.1366 - val_acc: 0.9539
Epoch 72/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1185 - acc: 0.9542 - val_loss: 0.1357 - val_acc: 0.9535
Epoch 73/150
53/52 [==============================] - 23s 440ms/step - loss: 0.1185 - acc: 0.9539 - val_loss: 0.1353 - val_acc: 0.9532
Epoch 74/150
53/52 [==============================] - 23s 442ms/step - loss: 0.1191 - acc: 0.9534 - val_loss: 0.1365 - val_acc: 0.9532
Epoch 75/150
53/52 [==============================] - 23s 439ms/step - loss: 0.1158 - acc: 0.9532 - val_loss: 0.1394 - val_acc: 0.9547
Epoch 76/150
53/52 [==============================] - 24s 446ms/step - loss: 0.1173 - acc: 0.9537 - val_loss: 0.1370 - val_acc: 0.9528
Epoch 77/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1140 - acc: 0.9545 - val_loss: 0.1419 - val_acc: 0.9535
Epoch 78/150
53/52 [==============================] - 23s 434ms/step - loss: 0.1146 - acc: 0.9558 - val_loss: 0.1389 - val_acc: 0.9539
Epoch 79/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1149 - acc: 0.9560 - val_loss: 0.1402 - val_acc: 0.9539
Epoch 80/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1182 - acc: 0.9537 - val_loss: 0.1357 - val_acc: 0.9535
Epoch 81/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1175 - acc: 0.9552 - val_loss: 0.1379 - val_acc: 0.9539
Epoch 82/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1152 - acc: 0.9538 - val_loss: 0.1398 - val_acc: 0.9543
Epoch 83/150
53/52 [==============================] - 24s 446ms/step - loss: 0.1180 - acc: 0.9521 - val_loss: 0.1433 - val_acc: 0.9550
Epoch 84/150
53/52 [==============================] - 23s 443ms/step - loss: 0.1185 - acc: 0.9526 - val_loss: 0.1373 - val_acc: 0.9532
Epoch 85/150
53/52 [==============================] - 23s 438ms/step - loss: 0.1164 - acc: 0.9531 - val_loss: 0.1374 - val_acc: 0.9543
Epoch 86/150
53/52 [==============================] - 23s 438ms/step - loss: 0.1186 - acc: 0.9534 - val_loss: 0.1411 - val_acc: 0.9547
Epoch 87/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1149 - acc: 0.9529 - val_loss: 0.1420 - val_acc: 0.9554
Epoch 88/150
53/52 [==============================] - 23s 439ms/step - loss: 0.1136 - acc: 0.9550 - val_loss: 0.1375 - val_acc: 0.9535
Epoch 89/150
53/52 [==============================] - 23s 440ms/step - loss: 0.1125 - acc: 0.9561 - val_loss: 0.1379 - val_acc: 0.9543
Epoch 90/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1151 - acc: 0.9543 - val_loss: 0.1371 - val_acc: 0.9535
Epoch 91/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1124 - acc: 0.9574 - val_loss: 0.1385 - val_acc: 0.9543
Epoch 92/150
53/52 [==============================] - 23s 439ms/step - loss: 0.1145 - acc: 0.9548 - val_loss: 0.1394 - val_acc: 0.9543
Epoch 93/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1153 - acc: 0.9554 - val_loss: 0.1386 - val_acc: 0.9547
Epoch 94/150
53/52 [==============================] - 23s 434ms/step - loss: 0.1165 - acc: 0.9536 - val_loss: 0.1384 - val_acc: 0.9543
Epoch 95/150
53/52 [==============================] - 23s 442ms/step - loss: 0.1099 - acc: 0.9567 - val_loss: 0.1396 - val_acc: 0.9535
Epoch 96/150
53/52 [==============================] - 23s 439ms/step - loss: 0.1149 - acc: 0.9547 - val_loss: 0.1412 - val_acc: 0.9543
Epoch 97/150
53/52 [==============================] - 23s 440ms/step - loss: 0.1221 - acc: 0.9500 - val_loss: 0.1387 - val_acc: 0.9535
Epoch 98/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1159 - acc: 0.9544 - val_loss: 0.1408 - val_acc: 0.9535
Epoch 99/150
53/52 [==============================] - 23s 439ms/step - loss: 0.1184 - acc: 0.9511 - val_loss: 0.1418 - val_acc: 0.9543
Epoch 100/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1205 - acc: 0.9547 - val_loss: 0.1414 - val_acc: 0.9543
Epoch 101/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1138 - acc: 0.9528 - val_loss: 0.1396 - val_acc: 0.9535
Epoch 102/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1186 - acc: 0.9522 - val_loss: 0.1381 - val_acc: 0.9532
Epoch 103/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1155 - acc: 0.9536 - val_loss: 0.1406 - val_acc: 0.9550
Epoch 104/150
53/52 [==============================] - 23s 438ms/step - loss: 0.1134 - acc: 0.9559 - val_loss: 0.1383 - val_acc: 0.9532
Epoch 105/150
53/52 [==============================] - 23s 434ms/step - loss: 0.1155 - acc: 0.9547 - val_loss: 0.1366 - val_acc: 0.9535
Epoch 106/150
53/52 [==============================] - 24s 444ms/step - loss: 0.1129 - acc: 0.9562 - val_loss: 0.1368 - val_acc: 0.9532
Epoch 107/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1179 - acc: 0.9545 - val_loss: 0.1402 - val_acc: 0.9539
Epoch 108/150
53/52 [==============================] - 23s 442ms/step - loss: 0.1108 - acc: 0.9562 - val_loss: 0.1395 - val_acc: 0.9539
Epoch 109/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1159 - acc: 0.9527 - val_loss: 0.1379 - val_acc: 0.9528
Epoch 110/150
53/52 [==============================] - 23s 434ms/step - loss: 0.1175 - acc: 0.9540 - val_loss: 0.1351 - val_acc: 0.9535
Epoch 111/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1156 - acc: 0.9550 - val_loss: 0.1370 - val_acc: 0.9532
Epoch 112/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1193 - acc: 0.9518 - val_loss: 0.1390 - val_acc: 0.9535
Epoch 113/150
53/52 [==============================] - 23s 438ms/step - loss: 0.1175 - acc: 0.9533 - val_loss: 0.1422 - val_acc: 0.9547
Epoch 114/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1132 - acc: 0.9557 - val_loss: 0.1409 - val_acc: 0.9535
Epoch 115/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1184 - acc: 0.9548 - val_loss: 0.1389 - val_acc: 0.9535
Epoch 116/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1100 - acc: 0.9578 - val_loss: 0.1393 - val_acc: 0.9547
Epoch 117/150
53/52 [==============================] - 23s 438ms/step - loss: 0.1161 - acc: 0.9555 - val_loss: 0.1423 - val_acc: 0.9550
Epoch 118/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1148 - acc: 0.9558 - val_loss: 0.1410 - val_acc: 0.9547
Epoch 119/150
53/52 [==============================] - 24s 444ms/step - loss: 0.1122 - acc: 0.9550 - val_loss: 0.1395 - val_acc: 0.9539
Epoch 120/150
53/52 [==============================] - 23s 440ms/step - loss: 0.1141 - acc: 0.9537 - val_loss: 0.1372 - val_acc: 0.9535
Epoch 121/150
53/52 [==============================] - 23s 439ms/step - loss: 0.1142 - acc: 0.9545 - val_loss: 0.1369 - val_acc: 0.9535
Epoch 122/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1170 - acc: 0.9547 - val_loss: 0.1362 - val_acc: 0.9543
Epoch 123/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1140 - acc: 0.9542 - val_loss: 0.1421 - val_acc: 0.9554
Epoch 124/150
53/52 [==============================] - 24s 444ms/step - loss: 0.1153 - acc: 0.9543 - val_loss: 0.1371 - val_acc: 0.9539
Epoch 125/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1126 - acc: 0.9551 - val_loss: 0.1367 - val_acc: 0.9543
Epoch 126/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1081 - acc: 0.9563 - val_loss: 0.1403 - val_acc: 0.9543
Epoch 127/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1123 - acc: 0.9543 - val_loss: 0.1412 - val_acc: 0.9547
Epoch 128/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1129 - acc: 0.9565 - val_loss: 0.1393 - val_acc: 0.9543
Epoch 129/150
53/52 [==============================] - 23s 440ms/step - loss: 0.1156 - acc: 0.9552 - val_loss: 0.1441 - val_acc: 0.9547
Epoch 130/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1145 - acc: 0.9549 - val_loss: 0.1390 - val_acc: 0.9547
Epoch 131/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1125 - acc: 0.9553 - val_loss: 0.1368 - val_acc: 0.9547
Epoch 132/150
53/52 [==============================] - 23s 438ms/step - loss: 0.1191 - acc: 0.9531 - val_loss: 0.1397 - val_acc: 0.9543
Epoch 133/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1150 - acc: 0.9558 - val_loss: 0.1387 - val_acc: 0.9550
Epoch 134/150
53/52 [==============================] - 23s 440ms/step - loss: 0.1183 - acc: 0.9541 - val_loss: 0.1376 - val_acc: 0.9554
Epoch 135/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1138 - acc: 0.9547 - val_loss: 0.1363 - val_acc: 0.9543
Epoch 136/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1163 - acc: 0.9545 - val_loss: 0.1417 - val_acc: 0.9550
Epoch 137/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1100 - acc: 0.9551 - val_loss: 0.1404 - val_acc: 0.9547
Epoch 138/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1181 - acc: 0.9532 - val_loss: 0.1358 - val_acc: 0.9543
Epoch 139/150
53/52 [==============================] - 23s 441ms/step - loss: 0.1143 - acc: 0.9542 - val_loss: 0.1379 - val_acc: 0.9547
Epoch 140/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1167 - acc: 0.9531 - val_loss: 0.1362 - val_acc: 0.9554
Epoch 141/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1123 - acc: 0.9546 - val_loss: 0.1347 - val_acc: 0.9547
Epoch 142/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1147 - acc: 0.9539 - val_loss: 0.1369 - val_acc: 0.9543
Epoch 143/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1137 - acc: 0.9559 - val_loss: 0.1413 - val_acc: 0.9554
Epoch 144/150
53/52 [==============================] - 23s 438ms/step - loss: 0.1113 - acc: 0.9572 - val_loss: 0.1409 - val_acc: 0.9550
Epoch 145/150
53/52 [==============================] - 23s 442ms/step - loss: 0.1164 - acc: 0.9536 - val_loss: 0.1428 - val_acc: 0.9554
Epoch 146/150
53/52 [==============================] - 23s 435ms/step - loss: 0.1172 - acc: 0.9541 - val_loss: 0.1387 - val_acc: 0.9547
Epoch 147/150
53/52 [==============================] - 23s 437ms/step - loss: 0.1135 - acc: 0.9551 - val_loss: 0.1375 - val_acc: 0.9547
Epoch 148/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1158 - acc: 0.9543 - val_loss: 0.1401 - val_acc: 0.9550
Epoch 149/150
53/52 [==============================] - 23s 436ms/step - loss: 0.1162 - acc: 0.9550 - val_loss: 0.1378 - val_acc: 0.9547
Epoch 150/150
53/52 [==============================] - 23s 439ms/step - loss: 0.1141 - acc: 0.9557 - val_loss: 0.1428 - val_acc: 0.9554
(env) secorec@boso:~/computer_vision$ 
