(env) secorec@boso:~/computer_vision$ python gender.py 
Using TensorFlow backend.
(10586, 100, 100, 3)
(10586,)
2382
8204
0.2250
(2647, 100, 100, 3)
(2647,)
595
2052
0.2248
(10586, 100, 100, 3)
(2647, 100, 100, 3)
2018-02-23 14:14:16.625737: I tensorflow/core/platform/cpu_feature_guard.cc:137] Your CPU supports instructions that this TensorFlow binary was not compiled to use: SSE4.1 SSE4.2 AVX
2018-02-23 14:14:17.190541: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1105] Found device 0 with properties: 
name: GeForce GTX TITAN X major: 5 minor: 2 memoryClockRate(GHz): 1.076
pciBusID: 0000:05:00.0
totalMemory: 11.92GiB freeMemory: 11.80GiB
2018-02-23 14:14:17.190577: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1195] Creating TensorFlow device (/device:GPU:0) -> (device: 0, name: GeForce GTX TITAN X, pci bus id: 0000:05:00.0, compute capability: 5.2)
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 100, 100, 32)      896       
_________________________________________________________________
batch_normalization_1 (Batch (None, 100, 100, 32)      128       
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 100, 100, 32)      0         
_________________________________________________________________
activation_1 (Activation)    (None, 100, 100, 32)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 50, 50, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 50, 50, 32)        9248      
_________________________________________________________________
batch_normalization_2 (Batch (None, 50, 50, 32)        128       
_________________________________________________________________
gaussian_noise_2 (GaussianNo (None, 50, 50, 32)        0         
_________________________________________________________________
activation_2 (Activation)    (None, 50, 50, 32)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 25, 25, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 25, 25, 64)        18496     
_________________________________________________________________
batch_normalization_3 (Batch (None, 25, 25, 64)        256       
_________________________________________________________________
gaussian_noise_3 (GaussianNo (None, 25, 25, 64)        0         
_________________________________________________________________
activation_3 (Activation)    (None, 25, 25, 64)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 12, 12, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 12, 12, 64)        36928     
_________________________________________________________________
batch_normalization_4 (Batch (None, 12, 12, 64)        256       
_________________________________________________________________
gaussian_noise_4 (GaussianNo (None, 12, 12, 64)        0         
_________________________________________________________________
activation_4 (Activation)    (None, 12, 12, 64)        0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 6, 6, 64)          0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 6, 6, 128)         73856     
_________________________________________________________________
batch_normalization_5 (Batch (None, 6, 6, 128)         512       
_________________________________________________________________
gaussian_noise_5 (GaussianNo (None, 6, 6, 128)         0         
_________________________________________________________________
activation_5 (Activation)    (None, 6, 6, 128)         0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 3, 3, 128)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 3, 3, 128)         147584    
_________________________________________________________________
batch_normalization_6 (Batch (None, 3, 3, 128)         512       
_________________________________________________________________
gaussian_noise_6 (GaussianNo (None, 3, 3, 128)         0         
_________________________________________________________________
activation_6 (Activation)    (None, 3, 3, 128)         0         
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 1, 1, 128)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               66048     
_________________________________________________________________
activation_7 (Activation)    (None, 512)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 1026      
_________________________________________________________________
activation_8 (Activation)    (None, 2)                 0         
=================================================================
Total params: 355,874
Trainable params: 354,978
Non-trainable params: 896
_________________________________________________________________
Epoch 1/150
53/52 [==============================] - 23s 441ms/step - loss: 0.6605 - acc: 0.7745 - val_loss: 0.4605 - val_acc: 0.7998
Epoch 2/150
53/52 [==============================] - 22s 421ms/step - loss: 0.4043 - acc: 0.8077 - val_loss: 0.4085 - val_acc: 0.8262
Epoch 3/150
53/52 [==============================] - 22s 423ms/step - loss: 0.3813 - acc: 0.8191 - val_loss: 0.3610 - val_acc: 0.8217
Epoch 4/150
53/52 [==============================] - 22s 423ms/step - loss: 0.3617 - acc: 0.8274 - val_loss: 0.3718 - val_acc: 0.8187
Epoch 5/150
53/52 [==============================] - 22s 423ms/step - loss: 0.3504 - acc: 0.8350 - val_loss: 0.3620 - val_acc: 0.8353
Epoch 6/150
53/52 [==============================] - 22s 422ms/step - loss: 0.3377 - acc: 0.8432 - val_loss: 0.3797 - val_acc: 0.8047
Epoch 7/150
53/52 [==============================] - 22s 424ms/step - loss: 0.3348 - acc: 0.8458 - val_loss: 0.4403 - val_acc: 0.7900
Epoch 8/150
53/52 [==============================] - 22s 422ms/step - loss: 0.3191 - acc: 0.8571 - val_loss: 0.3909 - val_acc: 0.8104
Epoch 9/150
53/52 [==============================] - 22s 422ms/step - loss: 0.3147 - acc: 0.8589 - val_loss: 0.3454 - val_acc: 0.8289
Epoch 10/150
53/52 [==============================] - 22s 421ms/step - loss: 0.3089 - acc: 0.8607 - val_loss: 0.3072 - val_acc: 0.8674
Epoch 11/150
53/52 [==============================] - 22s 423ms/step - loss: 0.3001 - acc: 0.8670 - val_loss: 0.3316 - val_acc: 0.8455
Epoch 12/150
53/52 [==============================] - 22s 421ms/step - loss: 0.2921 - acc: 0.8683 - val_loss: 0.5866 - val_acc: 0.7197
Epoch 13/150
53/52 [==============================] - 22s 423ms/step - loss: 0.2866 - acc: 0.8758 - val_loss: 0.3145 - val_acc: 0.8640
Epoch 14/150
53/52 [==============================] - 22s 423ms/step - loss: 0.2759 - acc: 0.8790 - val_loss: 0.5173 - val_acc: 0.7620
Epoch 15/150
53/52 [==============================] - 22s 423ms/step - loss: 0.2718 - acc: 0.8810 - val_loss: 0.2915 - val_acc: 0.8814
Epoch 16/150
53/52 [==============================] - 22s 421ms/step - loss: 0.2616 - acc: 0.8853 - val_loss: 0.2416 - val_acc: 0.8912
Epoch 17/150
53/52 [==============================] - 22s 423ms/step - loss: 0.2567 - acc: 0.8895 - val_loss: 0.2489 - val_acc: 0.8916
Epoch 18/150
53/52 [==============================] - 22s 422ms/step - loss: 0.2548 - acc: 0.8888 - val_loss: 0.3929 - val_acc: 0.8489
Epoch 19/150
53/52 [==============================] - 22s 421ms/step - loss: 0.2531 - acc: 0.8871 - val_loss: 0.6492 - val_acc: 0.7189
Epoch 20/150
53/52 [==============================] - 22s 422ms/step - loss: 0.2412 - acc: 0.8977 - val_loss: 0.2752 - val_acc: 0.8844
Epoch 21/150
53/52 [==============================] - 22s 421ms/step - loss: 0.2349 - acc: 0.8991 - val_loss: 0.4581 - val_acc: 0.8523
Epoch 22/150
53/52 [==============================] - 22s 423ms/step - loss: 0.2232 - acc: 0.9075 - val_loss: 0.2103 - val_acc: 0.9086
Epoch 23/150
53/52 [==============================] - 22s 423ms/step - loss: 0.2178 - acc: 0.9086 - val_loss: 0.1878 - val_acc: 0.9233
Epoch 24/150
53/52 [==============================] - 22s 422ms/step - loss: 0.2219 - acc: 0.9056 - val_loss: 0.1821 - val_acc: 0.9218
Epoch 25/150
53/52 [==============================] - 22s 422ms/step - loss: 0.2074 - acc: 0.9141 - val_loss: 0.2005 - val_acc: 0.9139
Epoch 26/150
53/52 [==============================] - 22s 424ms/step - loss: 0.1859 - acc: 0.9254 - val_loss: 0.1582 - val_acc: 0.9365
Epoch 27/150
53/52 [==============================] - 22s 424ms/step - loss: 0.1810 - acc: 0.9262 - val_loss: 0.1558 - val_acc: 0.9384
Epoch 28/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1761 - acc: 0.9264 - val_loss: 0.1778 - val_acc: 0.9256
Epoch 29/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1687 - acc: 0.9306 - val_loss: 0.1536 - val_acc: 0.9433
Epoch 30/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1766 - acc: 0.9250 - val_loss: 0.1752 - val_acc: 0.9282
Epoch 31/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1727 - acc: 0.9281 - val_loss: 0.1698 - val_acc: 0.9309
Epoch 32/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1733 - acc: 0.9301 - val_loss: 0.1922 - val_acc: 0.9192
Epoch 33/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1712 - acc: 0.9303 - val_loss: 0.1469 - val_acc: 0.9426
Epoch 34/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1677 - acc: 0.9304 - val_loss: 0.1512 - val_acc: 0.9407
Epoch 35/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1671 - acc: 0.9299 - val_loss: 0.1469 - val_acc: 0.9418
Epoch 36/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1646 - acc: 0.9309 - val_loss: 0.1458 - val_acc: 0.9460
Epoch 37/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1636 - acc: 0.9349 - val_loss: 0.1455 - val_acc: 0.9448
Epoch 38/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1646 - acc: 0.9331 - val_loss: 0.1585 - val_acc: 0.9373
Epoch 39/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1644 - acc: 0.9360 - val_loss: 0.1459 - val_acc: 0.9426
Epoch 40/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1656 - acc: 0.9322 - val_loss: 0.1490 - val_acc: 0.9448
Epoch 41/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1603 - acc: 0.9347 - val_loss: 0.1460 - val_acc: 0.9464
Epoch 42/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1633 - acc: 0.9322 - val_loss: 0.1417 - val_acc: 0.9467
Epoch 43/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1579 - acc: 0.9346 - val_loss: 0.1390 - val_acc: 0.9464
Epoch 44/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1592 - acc: 0.9329 - val_loss: 0.1416 - val_acc: 0.9486
Epoch 45/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1594 - acc: 0.9360 - val_loss: 0.1399 - val_acc: 0.9464
Epoch 46/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1596 - acc: 0.9361 - val_loss: 0.1597 - val_acc: 0.9369
Epoch 47/150
53/52 [==============================] - 22s 424ms/step - loss: 0.1589 - acc: 0.9357 - val_loss: 0.1459 - val_acc: 0.9448
Epoch 48/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1600 - acc: 0.9389 - val_loss: 0.1397 - val_acc: 0.9460
Epoch 49/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1581 - acc: 0.9339 - val_loss: 0.1375 - val_acc: 0.9460
Epoch 50/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1524 - acc: 0.9391 - val_loss: 0.1429 - val_acc: 0.9475
Epoch 51/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1559 - acc: 0.9365 - val_loss: 0.1417 - val_acc: 0.9475
Epoch 52/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1511 - acc: 0.9381 - val_loss: 0.1406 - val_acc: 0.9471
Epoch 53/150
36/52 [===================>..........] - ETA: 6s - loss: 0.1486 - acc: 0.9403^Z
[1]+  Aturat                  python gender.py
(env) secorec@boso:~/computer_vision$ fg
python gender.py
53/52 [==============================] - 712s 13s/step - loss: 0.1524 - acc: 0.9377 - val_loss: 0.1364 - val_acc: 0.9479
Epoch 54/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1505 - acc: 0.9371 - val_loss: 0.1393 - val_acc: 0.9464
Epoch 55/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1505 - acc: 0.9411 - val_loss: 0.1388 - val_acc: 0.9471
Epoch 56/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1520 - acc: 0.9385 - val_loss: 0.1373 - val_acc: 0.9482
Epoch 57/150
53/52 [==============================] - 23s 425ms/step - loss: 0.1526 - acc: 0.9400 - val_loss: 0.1371 - val_acc: 0.9486
Epoch 58/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1574 - acc: 0.9377 - val_loss: 0.1382 - val_acc: 0.9471
Epoch 59/150
53/52 [==============================] - 23s 425ms/step - loss: 0.1493 - acc: 0.9379 - val_loss: 0.1359 - val_acc: 0.9479
Epoch 60/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1536 - acc: 0.9356 - val_loss: 0.1378 - val_acc: 0.9482
Epoch 61/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1454 - acc: 0.9411 - val_loss: 0.1429 - val_acc: 0.9475
Epoch 62/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1534 - acc: 0.9377 - val_loss: 0.1371 - val_acc: 0.9479
Epoch 63/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1539 - acc: 0.9353 - val_loss: 0.1400 - val_acc: 0.9479
Epoch 64/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1492 - acc: 0.9395 - val_loss: 0.1363 - val_acc: 0.9475
Epoch 65/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1493 - acc: 0.9400 - val_loss: 0.1368 - val_acc: 0.9479
Epoch 66/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1540 - acc: 0.9362 - val_loss: 0.1370 - val_acc: 0.9471
Epoch 67/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1471 - acc: 0.9398 - val_loss: 0.1375 - val_acc: 0.9475
Epoch 68/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1513 - acc: 0.9385 - val_loss: 0.1400 - val_acc: 0.9467
Epoch 69/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1490 - acc: 0.9400 - val_loss: 0.1380 - val_acc: 0.9482
Epoch 70/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1468 - acc: 0.9402 - val_loss: 0.1364 - val_acc: 0.9482
Epoch 71/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1520 - acc: 0.9394 - val_loss: 0.1426 - val_acc: 0.9471
Epoch 72/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1525 - acc: 0.9358 - val_loss: 0.1379 - val_acc: 0.9479
Epoch 73/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1545 - acc: 0.9380 - val_loss: 0.1355 - val_acc: 0.9494
Epoch 74/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1539 - acc: 0.9405 - val_loss: 0.1367 - val_acc: 0.9479
Epoch 75/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1486 - acc: 0.9395 - val_loss: 0.1377 - val_acc: 0.9475
Epoch 76/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1467 - acc: 0.9403 - val_loss: 0.1357 - val_acc: 0.9482
Epoch 77/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1487 - acc: 0.9398 - val_loss: 0.1361 - val_acc: 0.9464
Epoch 78/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1514 - acc: 0.9362 - val_loss: 0.1360 - val_acc: 0.9460
Epoch 79/150
53/52 [==============================] - 22s 420ms/step - loss: 0.1435 - acc: 0.9392 - val_loss: 0.1377 - val_acc: 0.9482
Epoch 80/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1523 - acc: 0.9398 - val_loss: 0.1375 - val_acc: 0.9467
Epoch 81/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1532 - acc: 0.9396 - val_loss: 0.1363 - val_acc: 0.9479
Epoch 82/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1496 - acc: 0.9386 - val_loss: 0.1393 - val_acc: 0.9464
Epoch 83/150
53/52 [==============================] - 22s 424ms/step - loss: 0.1460 - acc: 0.9402 - val_loss: 0.1403 - val_acc: 0.9464
Epoch 84/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1467 - acc: 0.9399 - val_loss: 0.1410 - val_acc: 0.9467
Epoch 85/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1526 - acc: 0.9362 - val_loss: 0.1399 - val_acc: 0.9482
Epoch 86/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1455 - acc: 0.9393 - val_loss: 0.1404 - val_acc: 0.9471
Epoch 87/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1435 - acc: 0.9401 - val_loss: 0.1361 - val_acc: 0.9490
Epoch 88/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1464 - acc: 0.9409 - val_loss: 0.1372 - val_acc: 0.9479
Epoch 89/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1534 - acc: 0.9397 - val_loss: 0.1396 - val_acc: 0.9460
Epoch 90/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1512 - acc: 0.9382 - val_loss: 0.1376 - val_acc: 0.9479
Epoch 91/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1519 - acc: 0.9374 - val_loss: 0.1342 - val_acc: 0.9479
Epoch 92/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1513 - acc: 0.9382 - val_loss: 0.1365 - val_acc: 0.9486
Epoch 93/150
53/52 [==============================] - 22s 424ms/step - loss: 0.1498 - acc: 0.9391 - val_loss: 0.1364 - val_acc: 0.9479
Epoch 94/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1470 - acc: 0.9426 - val_loss: 0.1387 - val_acc: 0.9475
Epoch 95/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1488 - acc: 0.9400 - val_loss: 0.1446 - val_acc: 0.9479
Epoch 96/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1462 - acc: 0.9420 - val_loss: 0.1409 - val_acc: 0.9460
Epoch 97/150
53/52 [==============================] - 22s 424ms/step - loss: 0.1457 - acc: 0.9417 - val_loss: 0.1381 - val_acc: 0.9479
Epoch 98/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1475 - acc: 0.9411 - val_loss: 0.1432 - val_acc: 0.9467
Epoch 99/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1503 - acc: 0.9384 - val_loss: 0.1402 - val_acc: 0.9464
Epoch 100/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1473 - acc: 0.9424 - val_loss: 0.1389 - val_acc: 0.9467
Epoch 101/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1497 - acc: 0.9379 - val_loss: 0.1352 - val_acc: 0.9490
Epoch 102/150
53/52 [==============================] - 22s 424ms/step - loss: 0.1546 - acc: 0.9368 - val_loss: 0.1358 - val_acc: 0.9475
Epoch 103/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1449 - acc: 0.9415 - val_loss: 0.1377 - val_acc: 0.9471
Epoch 104/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1448 - acc: 0.9401 - val_loss: 0.1387 - val_acc: 0.9467
Epoch 105/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1473 - acc: 0.9414 - val_loss: 0.1424 - val_acc: 0.9460
Epoch 106/150
53/52 [==============================] - 22s 424ms/step - loss: 0.1431 - acc: 0.9430 - val_loss: 0.1410 - val_acc: 0.9471
Epoch 107/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1504 - acc: 0.9382 - val_loss: 0.1373 - val_acc: 0.9479
Epoch 108/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1507 - acc: 0.9374 - val_loss: 0.1373 - val_acc: 0.9482
Epoch 109/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1490 - acc: 0.9389 - val_loss: 0.1389 - val_acc: 0.9467
Epoch 110/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1451 - acc: 0.9410 - val_loss: 0.1373 - val_acc: 0.9475
Epoch 111/150
53/52 [==============================] - 22s 424ms/step - loss: 0.1498 - acc: 0.9394 - val_loss: 0.1396 - val_acc: 0.9456
Epoch 112/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1456 - acc: 0.9418 - val_loss: 0.1371 - val_acc: 0.9475
Epoch 113/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1494 - acc: 0.9407 - val_loss: 0.1379 - val_acc: 0.9464
Epoch 114/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1446 - acc: 0.9429 - val_loss: 0.1367 - val_acc: 0.9471
Epoch 115/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1456 - acc: 0.9395 - val_loss: 0.1384 - val_acc: 0.9460
Epoch 116/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1477 - acc: 0.9398 - val_loss: 0.1375 - val_acc: 0.9460
Epoch 117/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1509 - acc: 0.9386 - val_loss: 0.1412 - val_acc: 0.9467
Epoch 118/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1503 - acc: 0.9408 - val_loss: 0.1377 - val_acc: 0.9475
Epoch 119/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1490 - acc: 0.9416 - val_loss: 0.1427 - val_acc: 0.9475
Epoch 120/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1445 - acc: 0.9444 - val_loss: 0.1375 - val_acc: 0.9471
Epoch 121/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1495 - acc: 0.9405 - val_loss: 0.1349 - val_acc: 0.9479
Epoch 122/150
53/52 [==============================] - 22s 424ms/step - loss: 0.1447 - acc: 0.9421 - val_loss: 0.1358 - val_acc: 0.9464
Epoch 123/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1472 - acc: 0.9371 - val_loss: 0.1371 - val_acc: 0.9475
Epoch 124/150
53/52 [==============================] - 22s 420ms/step - loss: 0.1401 - acc: 0.9431 - val_loss: 0.1372 - val_acc: 0.9471
Epoch 125/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1471 - acc: 0.9408 - val_loss: 0.1379 - val_acc: 0.9482
Epoch 126/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1494 - acc: 0.9390 - val_loss: 0.1379 - val_acc: 0.9475
Epoch 127/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1480 - acc: 0.9412 - val_loss: 0.1353 - val_acc: 0.9494
Epoch 128/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1517 - acc: 0.9381 - val_loss: 0.1364 - val_acc: 0.9479
Epoch 129/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1470 - acc: 0.9433 - val_loss: 0.1367 - val_acc: 0.9464
Epoch 130/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1484 - acc: 0.9401 - val_loss: 0.1407 - val_acc: 0.9464
Epoch 131/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1465 - acc: 0.9405 - val_loss: 0.1383 - val_acc: 0.9460
Epoch 132/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1449 - acc: 0.9413 - val_loss: 0.1365 - val_acc: 0.9467
Epoch 133/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1463 - acc: 0.9423 - val_loss: 0.1372 - val_acc: 0.9475
Epoch 134/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1513 - acc: 0.9376 - val_loss: 0.1370 - val_acc: 0.9475
Epoch 135/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1506 - acc: 0.9409 - val_loss: 0.1388 - val_acc: 0.9460
Epoch 136/150
53/52 [==============================] - 23s 425ms/step - loss: 0.1497 - acc: 0.9380 - val_loss: 0.1356 - val_acc: 0.9471
Epoch 137/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1484 - acc: 0.9405 - val_loss: 0.1353 - val_acc: 0.9486
Epoch 138/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1471 - acc: 0.9383 - val_loss: 0.1380 - val_acc: 0.9479
Epoch 139/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1438 - acc: 0.9398 - val_loss: 0.1386 - val_acc: 0.9464
Epoch 140/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1451 - acc: 0.9402 - val_loss: 0.1393 - val_acc: 0.9467
Epoch 141/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1427 - acc: 0.9445 - val_loss: 0.1371 - val_acc: 0.9471
Epoch 142/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1474 - acc: 0.9423 - val_loss: 0.1353 - val_acc: 0.9482
Epoch 143/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1474 - acc: 0.9425 - val_loss: 0.1375 - val_acc: 0.9471
Epoch 144/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1472 - acc: 0.9394 - val_loss: 0.1342 - val_acc: 0.9479
Epoch 145/150
53/52 [==============================] - 22s 420ms/step - loss: 0.1451 - acc: 0.9392 - val_loss: 0.1358 - val_acc: 0.9479
Epoch 146/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1461 - acc: 0.9428 - val_loss: 0.1395 - val_acc: 0.9460
Epoch 147/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1380 - acc: 0.9433 - val_loss: 0.1385 - val_acc: 0.9460
Epoch 148/150
53/52 [==============================] - 22s 423ms/step - loss: 0.1478 - acc: 0.9406 - val_loss: 0.1361 - val_acc: 0.9467
Epoch 149/150
53/52 [==============================] - 22s 421ms/step - loss: 0.1442 - acc: 0.9402 - val_loss: 0.1364 - val_acc: 0.9471
Epoch 150/150
53/52 [==============================] - 22s 422ms/step - loss: 0.1399 - acc: 0.9443 - val_loss: 0.1381 - val_acc: 0.9464